###############################################################
#  Generated by:      Cadence Innovus 25.13-s088_1
#  OS:                Linux x86_64(Host ID vlsi.iitgn.ac.in)
#  Generated on:      Sat May 23 09:34:42 2026
#  Design:            counter
#  Command:           saveDesign db_06_cts.enc
###############################################################
current_design counter
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_clock_transition  -rise -min 0.1 [get_clocks {clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
#END OF CLOCK SECTION#
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[11]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[5]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[14]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[8]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {load}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[12]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[6]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[10]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {en}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[15]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[9]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {up_down}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[13]}]
set_input_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {d[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[0]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[15]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {tc}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[13]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[11]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[9]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[5]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[14]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {borrow}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[12]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[10]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[8]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {clk}] [get_ports {q[4]}]
